/* eslint-disable camelcase */
const path = require('path');
const fs = require('fs').promises;
const FederalDistrict = require('../models')
const Region = require('../models')
const Municipality = require('../models')


// const data = await (await fs.readFile(path.join(__dirname,'db/mun_obr.csv'),'utf-8'))
// .split('\n')
// .shift()
// .map((row)=>row.splt(';'))
// .map((values)=>({municipalityName:values[3], regionName:values[7]}))
// .array.filter((pairOfValues)=>
//   districtReltions.some((district)=>
//   district.some(()=>
//   district.Regions.some((region)=>
//   region.name===pairOfValues[0])))
// )
// const regions = '';


const districtRelations = [
    {name: 'Центральный федеральный округ',
    Regions:[{
      name:'Белгородская область' 
    },
    {
      name:'Брянская область' 
    },
    {
      name:'Владимирская область' 
    },
    {
      name:'Воронежская область' 
    },
    {
      name:'Ивановская область' 
    },
    {
      name:'Калужская область' 
    },
    {
      name:'Костромская область' 
    },
    {
      name:'Курская область' 
    },
    {
      name:'Липецкая область' 
    },
    {
      name:'Московская область' 
    },
    {
      name:'Орловская область' 
    },
    {
      name:'Рязанская область' 
    },
    {
      name:'Тамбовская область' 
    },
    {
      name:'Тверская область' 
    },
    {
      name:'Тульская область' 
    },
    {
      name:'Ярославская область' 
    },
    {  
      name:'Ярославская область' 
    },]},
  
    {
      name: 'Южный федеральный округ',
      Regions:[{
        name:'Республика Адыгея' 
      },
      {
        name:'Республика Калмыкия' 
      },
      {
        name:'Краснодарский край' 
      },
      {
        name:'Астраханская область' 
      },
      {
        name:'Ивановская область' 
      },
      {
        name:'Ростовская область' 
      },]
    },
  
      {
      name: 'Северо-Западный федеральный округ',
      Regions:[{
        name:'Республика Карелия' 
      },
      {
        name:'Республика Коми' 
      },
      {
        name:'Архангельская область' 
      },
      {
        name:'Вологодская область' 
      },
      {
        name:'Калининградская область' 
      },
      {
        name:'Ленинградская область' 
      },
      {
        name:'Мурманская область' 
      },
      {
        name:'Новгородская область' 
      },
      {
        name:'Псковская область' 
      },
      {
        name:'Город федерального значения Санкт-Петербург' 
      },
      {
        name:'Ненецкий автономный округ' 
      },]
    },
  
    {
      name: 'Дальневосточный федеральный округ',
      Regions:[{
        name:'Республика Саха' 
      },
      {
        name:'Камчатский край' 
      },
      {
        name:'Приморский край' 
      },
      {
        name:'Хабаровский край' 
      },
      {
        name:'Амурская область' 
      },
      {
        name:'Магаданская область' 
      },
      {
        name:'Сахалинская область' 
      },
      {
        name:'Еврейская автономная область' 
      },
      {
        name:'Чукотский автономный округ' 
      },]
    },
  
    {
      name: 'Сибирский федеральный округ',
      Regions:[{
        name:'Республика Алтай' 
      },
      {
        name:'Республика Бурятия' 
      },
      {
        name:'Республика Тыва' 
      },
      {
        name:'Республика Хакасия' 
      },
      {
        name:'Алтайский край' 
      },
      {
        name:'Забайкальский край' 
      },
      {
        name:'Красноярский край' 
      },
      {
        name:'Иркутская область' 
      },
      {
        name:'Кемеровская область' 
      },
      {
        name:'Новосибирская область' 
      },
      {
        name:'Омская область' 
      },
      {
        name:'Томская область' 
      },]
    },
  
    {
      name: 'Уральский федеральный округ',
      Regions:[{
        name:'Курганская область' 
      },
      {
        name:'Свердловская область' 
      },
      {
        name:'Тюменская область' 
      },
      {
        name:'Челябинская область' 
      },
      {
        name:'Челябинская область' 
      },
      {
        name:'Ямало-Ненецкий автономный округ' 
      },]
    },
  
    {
      name: 'Приволжский федеральный округ',
      Regions:[{
        name:'Республика Башкортостан' 
      },
      {
        name:'Республика Марий Эл' 
      },
      {
        name:'Республика Мордовия' 
      },
      {
        name:'Республика Татарстан' 
      },
      {
        name:'Удмуртская Республика' 
      },
      {
        name:'Чувашская Республика' 
      },
      {
        name:'Кировская область' 
      },
      {
        name:'Нижегородская область' 
      },
      {
        name:'Оренбургская область' 
      },
      {
        name:'Пензенская область' 
      },
      {
        name:'Пермский край' 
      },
      {
        name:'Самарская область' 
      },
      {
        name:'Саратовская область' 
      },
      {
        name:'Ульяновская область' 
      },]
    },
    
    {
        name: 'Северо-Кавказский федеральный округ',
        Regions:[{
          name:'Республика Дагестан' 
        },
        {
          name:'Республика Ингушетия' 
        },
        {
          name:'Кабардино-Балкарская Республика' 
        },
        {
          name:'Карачаево-Черкесская Республика' 
        },
        {
          name:'Республика Северная Осетия — Алания' 
        },
        {
          name:'Чеченская Республика' 
        },
        {
          name:'Ставропольский край' 
        }]
    }
  ]

  // async function main(){
  //   const data = await ( fs.readFile(path.join(__dirname,'/mun_obr.csv'),'utf-8'))
  //   const valuePairs = data.split('\n')
  //   .map((row)=>row.split(';'))
  //   .map((values)=>({municipalityName:values[3], regionName:values[7]}))
  //   // console.log(valuePairs)
  //   const filteredPairs = valuePairs.filter((obj1)=>districtRelations.some((obj2)=>obj2.Regions.some((obj3)=>obj3.name === obj1.regionName))) 
  //   const obj = {}
  //   filteredPairs.map((pair)=>{

  //   })
    // console.log(filteredPairs)
// }
// let i = 1
//   function trans(){
//     const obj = {};
//     const arr = districtRelations.map((dist)=>{
//       // eslint-disable-next-line no-return-assign
//     dist.Regions.forEach((obj1)=>obj[obj1.name]=i)
//     i+=1
//   }
//     )
//     console.log(obj)
//   }

//   trans()
const objOfRelations ={
  'Белгородская область': 1,
  'Брянская область': 1,
  'Владимирская область': 1,
  'Воронежская область': 1,
  'Ивановская область': 2,
  'Калужская область': 1,
  'Костромская область': 1,
  'Курская область': 1,
  'Липецкая область': 1,
  'Московская область': 1,
  'Орловская область': 1,
  'Рязанская область': 1,
  'Тамбовская область': 1,
  'Тверская область': 1,
  'Тульская область': 1,
  'Ярославская область': 1,
  'Республика Адыгея': 2,
  'Республика Калмыкия': 2,
  'Краснодарский край': 2,
  'Астраханская область': 2,
  'Ростовская область': 2,
  'Республика Карелия': 3,
  'Республика Коми': 3,
  'Архангельская область': 3,
  'Вологодская область': 3,
  'Калининградская область': 3,
  'Ленинградская область': 3,
  'Мурманская область': 3,
  'Новгородская область': 3,
  'Псковская область': 3,
  'Город федерального значения Санкт-Петербург': 3,
  'Ненецкий автономный округ': 3,
  'Республика Саха': 4,
  'Камчатский край': 4,
  'Приморский край': 4,
  'Хабаровский край': 4,
  'Амурская область': 4,
  'Магаданская область': 4,
  'Сахалинская область': 4,
  'Еврейская автономная область': 4,
  'Чукотский автономный округ': 4,
  'Республика Алтай': 5,
  'Республика Бурятия': 5,
  'Республика Тыва': 5,
  'Республика Хакасия': 5,
  'Алтайский край': 5,
  'Забайкальский край': 5,
  'Красноярский край': 5,
  'Иркутская область': 5,
  'Кемеровская область': 5,
  'Новосибирская область': 5,
  'Омская область': 5,
  'Томская область': 5,
  'Курганская область': 6,
  'Свердловская область': 6,
  'Тюменская область': 6,
  'Челябинская область': 6,
  'Ямало-Ненецкий автономный округ': 6,
  'Республика Башкортостан': 7,
  'Республика Марий Эл': 7,
  'Республика Мордовия': 7,
  'Республика Татарстан': 7,
  'Удмуртская Республика': 7,
  'Чувашская Республика': 7,
  'Кировская область': 7,
  'Нижегородская область': 7,
  'Оренбургская область': 7,
  'Пензенская область': 7,
  'Пермский край': 7,
  'Самарская область': 7,
  'Саратовская область': 7,
  'Ульяновская область': 7,
  'Республика Дагестан': 8,
  'Республика Ингушетия': 8,
  'Кабардино-Балкарская Республика': 8,
  'Карачаево-Черкесская Республика': 8,
  'Республика Северная Осетия — Алания': 8,
  'Чеченская Республика': 8,
  'Ставропольский край': 8
}
  module.exports = {objOfRelations, districtRelations};
